{
  "focalworks.book.patterns.spells.rigging_foci": "Rigging Foci",
  "focalworks.book.patterns.spells.rigging_foci.explainer0": "In my studies, I have discovered the art of $(#9474ed)Rigging$(). \"$(#9474ed)Rigged$()\" foci (or any iota holder, for that matter) cast a hex upon reads or writes. Reads cast after reading the iota (with it starting on the stack), and writes start before a write, starting with the iota-to-write on the stack. Curiously, writes also have the option to leave a boolean on the stack, indicating whether the write should go through.",,,
  "focalworks.book.patterns.spells.rigging_foci.explainer1": "Finally, there also seems to be a way to $(#edb874)Crack$() these iota holders, which must be done before any rigging has been done. Attempting to crack a rigged item will cloud my vision for ten seconds. Cracked items display their rigged reads/writes on their tooltip.",
  "focalworks.book.patterns.spells.rigging_foci.rig_read": "Takes in an item entity and a hex, and rigs the item's read to that hex.",
  "focalworks.book.patterns.spells.rigging_foci.rig_write": "Takes in an item entity and a hex, and rigs the item's write to that hex.",

  "focalworks.book.patterns.spells.misc_page": "Miscellaneous Focalworking",
  "focalworks.book.patterns.spells.misc_page.explainer0": "I have discovered a few patterns, but they do not seem to fit into any of my previous categories. To solve this problem whilst keeping them documented, I have placed them here for my convenience.",
  "focalworks.book.patterns.spells.misc_page.flip_spellbook": "This pattern takes in a spellbook item entity and a num, and flips the spellbook to that page.",

  "focalworks.riggedread.onitem": "Rigged Read: %s",
  "focalworks.riggedwrite.onitem": "Rigged Write: %s",
  "focalworks.rig_read": "Rig Read",
  "focalworks.rig_write": "Rig Write",
  "focalworks.crack_rig": "Crack Rig",
  "focalworks.flip_spellbook": "Flip Spellbook",
  "hexcasting.action.book.focalworks:crack_rig": "Crack Rig"
}
